{
    "children": [
        {
            "goal": "REFLECTIVE JOURNAL ENTRIES",
            "id": "7.1",
            "name": "REFLECTIVE JOURNAL ENTRIES",
            "nodeType": "Title",
            "page": null,
            "text": "REFLECTIVE JOURNAL ENTRIES"
        },
        {
            "goal": "- The reflective journal documents the participant's experiences from the first to sixth weeks of the program, employing the DIEP approach to provide a comprehensive analysis of activities, tasks, and learning objectives. This method encourages detailed recording and reflection on experiences ('D' for Describe), interpreting the significance of these experiences ('I' for Interpret), evaluating the effectiveness of actions taken ('E' for Evaluate), and planning future applications of learned knowledge ('P' for Plan). Insights into new understandings, teamwork dynamics, and personal growth are discussed, alongside reflections guided by mentor Ivan Bakhshayeshi and coordinator Jennifer Yang, making the journal a tool for tracking performance and deriving lessons for career advancement.\n",
            "id": "7.2",
            "name": "The r",
            "nodeType": "Paragraph",
            "page": null,
            "text": "The reflective journal has the information of all the weeks till now which are one to sixth \nweek so far, it includes all the detailed discussion of the activities which are carried forward \nin this program and the detailed description of the task has been assigned and learning \nobjectives which has been delivered so far from the organization and mentor. This journal \nhelps me to keep track of my performance in all over the period of this program. The \napproach used to write this journal is pretty informative that is called DIEP approach as \ngiven in the template, where the word ‘D’ stands for describe which hold the objective of \nwhat happened? What did I see? What did I read? What did I have heard? And so on while \nthe word ‘I’ stands for interpretation of the events which occurred during this program and \nhave detailed about new insights, my connection with other attendees presented in  this \nprogram, my feelings towards them, the team work if there’s any involved, my hypothesis \nfollowed by conclusion and then we have the word ‘E’ which sums up the efficiency of what \nI have observed, my opinion regarding those observations, effectiveness of observation and \non what grounds I am making these experiences count, last but not the least we have the \nword ‘P’ which stands for planning of how this learning experience is useful in future for my \ncareer and what its serves in the long professional run and what are my recommendations.  \nAll the fellow activates and task happened under the supervision of the mentor Ivan \nBakhshayeshi and the coordinator of this program who is Jennifer Yang."
        },
        {
            "goal": "WEEK#07",
            "id": "7.3",
            "name": "WEEK#07",
            "nodeType": "Title",
            "page": null,
            "text": "WEEK#07"
        },
        {
            "goal": "- In the 7th week of the program, the project officially commenced with a consultation hour focusing on its objectives, significance in deep learning applications, and real-world impact. The mentor, Mr. Ivan, shared insights from his own professional experience with similar projects, emphasizing the complexities of working with big data. Discussions included the project's vast scope, integration possibilities, and the need to navigate challenges related to face recognition technologies. The mentor outlined the project's protocols, suggesting a shift to bi-weekly sessions post-Easter break for task assignments and presentations. Participants, reflecting on their academic and project-related experiences in data science, were encouraged to research face recognition systems further, identifying potential depths and challenges. The mentor's enthusiasm significantly motivated the participants, fostering a collaborative environment to address the project's challenges. In the follow-up session, specific issues and the extent of project development were deliberated, with an emphasis on leveraging relevant libraries for face recognition.\n",
            "id": "7.4",
            "name": "In th",
            "nodeType": "Paragraph",
            "page": null,
            "text": "In the 7th week we have kick start of the project, in 1st session of the week was all about \nconsultation hour where we discussed the overview of the project and my mentor Mr. Ivan \nhas demonstrated the project’s aim and purpose and importance of this deep learning \nproject in the real world.  \nWhile discussing the project outcomes, we come across that this is the very vast project and \nhas previously been worked on but still it does have so many features which can be \nintegrated with it, this session we discussed that our mentor has also worked in this kind of \nproject in his professional life and how hard it is to work with big data in cooperation with \nthis kind of application.  \nOur mentor has also discussed what are the protocols to work on this project where we \ncome across that from now on after easter break we will have two session per week same \nas past but in the first session we will assign the task related to the project and in the \nsecond session we all have present our work to the mentor.  \nIn this meeting we have also discussed the related problems regarding this project and \neveryone has a say who related to the data science background what we have achieve in \nour university times and what deep learning projects we have worked with on academic \nlevel and in the end, we have been assigned to study related or similar problems of face \nrecognition systems and how deep we can go and what challenges we can face while \nworking on this application. The enthusiasm and support from the mentor were pretty high \nwhich gives me motivation to do better.  \nIn the 2nd session we discussed the related problems and challenges which needs to \novercome while working on this project. The libraries we have explored related to face \nrecognition system been discussed to and to what extend we should take this project been"
        },
        {
            "goal": "- The sessions post-Easter break were strategically rescheduled to ensure continued progress on the project. This adjustment was part of a broader conclusion that emphasized the effective learning environment provided by the ITIC team, where both the mentor and Ms. Jennifer actively addressed and entertained all participant queries, fostering a supportive and insightful educational experience.\n",
            "id": "7.5",
            "name": "15 \nh",
            "nodeType": "Paragraph",
            "page": null,
            "text": "15 \nhighlighted too. In the end, we got our rescheduled for the upcoming sessions and how we \nwill proceed with these in future after easter break.  \nIn conclusion, so we have great learning environment provided by ITIC team and all our \nqueries has been entertained from both our mentor and Ms. Jennifer."
        },
        {
            "goal": "- The reflective journal details events up to week 7, noting the transition to one consultation and one presentation session per week as guided by the mentor, Mr. Ivan. This change aims to foster improved learning outcomes by assigning specific tasks for practice and presentation, encouraging a professional approach and mindset. Participants are expected to engage deeply with their assignments, preparing to address queries and share insights in a professional setting, which is anticipated to enrich the learning experience further as the program progresses.\n",
            "id": "7.6",
            "name": "This ",
            "nodeType": "Paragraph",
            "page": null,
            "text": "This reflective journal holds the detailed events’ entries till week#7 as we will go forward \nthere’s going to be new findings, observations and learning experiences will come by time. \nThe project has been kicked in from the last week and as by mentor there’s going be one \nsession per week which will be reserved for consultation and the other one would use for \npresentation of the work we will perform and keeping in loop with Mr. Ivan would help me \nto get better learning outcomes out of this program, so far this is what I have observed, He \nalso mentioned that in consulting session we all will be provided with different task which \nwe need to practice and present in the second session and these meetings would be really \nprofessional where you have to come up with different ideas and professional mindset \nalong with the research work home work so you can answer all the related queries of the \nattendees."
        },
        {
            "goal": "WEEK#08",
            "id": "7.7",
            "name": "WEEK#08",
            "nodeType": "Title",
            "page": null,
            "text": "WEEK#08"
        },
        {
            "goal": "- Week 8 marked the initiation of the project focused on creating a student attendance system utilizing face recognition technology. The mentor, Mr. Ivan, detailed the project's goals and the technical framework necessary for its achievement, emphasizing the use of live cameras for identifying students in online classes to assist teachers with accurate attendance marking. Participants received a foundational understanding of the technology and its applications, with instructions to commence building a database using TensorFlow's data augmentation techniques and Keras for at least 20 images. This hands-on approach aimed at fostering a deeper exploration of the subject matter provided an opportunity for participants to clarify their theoretical knowledge under the guidance of a professional mentor, enriching their learning experience.\n",
            "id": "7.8",
            "name": "The 8",
            "nodeType": "Paragraph",
            "page": null,
            "text": "The 8th week is started with project initialization.  \nThis week, we have discussed about the objective of the project, where our mentor \nexplained what we are going to working on, which is going to be a student attendance \nsystem by using face recognition method. This project will be able to detect the faces of the \nstudent through live camera which helps the teachers to mark student attendance in online \nclasses. To start working on this project first we need background knowledge of the \nobjective and the available packages, so Mr. Ivan has shared quite good knowledge and \nmaterial of how these application works and their specifications.  \nWe have been assigned the task to start creating database by using TensorFlow data \naugmentation technique and explore all the related like image data generator and create \nand data base to start working, we all have to create a database of at least 20 images by \nusing keras data augmentation techniques and shared it around so we can go further from \nthere.  \nTo learn and explore about this project is an interesting part and working with the \nprofessional mentor helping me to clear my theories which I was shy enough to ask in my \nclass."
        },
        {
            "goal": "- In Week 9, the focus shifted to the practical aspects of project development, with the mentor guiding the participants on constructing a database integral for the student attendance system. The use of CV2, a Python library, was recommended for capturing live images to build a substantial dataset of student faces. The collaborative effort was emphasized, suggesting the sharing of databases among participants to refine the model's accuracy through broader data testing. The session concluded with task assignments that involve enhancing the database with TensorFlow and Keras's data augmentation techniques and further exploring tools related to face recognition, aiming to solidify the foundational work for the project's success.\n",
            "id": "7.9",
            "name": "16 \nW",
            "nodeType": "Paragraph",
            "page": null,
            "text": "16 \nWEEK#09 \nThe 9th week is started working on the project.  \nThis week, we have discussed about the how to create the database for the project, our \nMentor has shown us how it needs to be done share some resources for the reference as \nwell, we have started making database that consists of images of the student, we are all \nadvised to share our databases with each other so we can test our model and get better and \naccurate results.  \nThe database should be created by using python library CV2 which will access your live \ncamera take snapshot which should be uploaded on some medium to be shared across the \nmates, so far, we are successful to create our individual datasets now we need to use keras \ndata augmentation techniques to train our data and get the results. In the first meeting we \nhave presented our datasets and discussed the issues facing while creating them.  \nWe have been assigned the task to start working with the database by using TensorFlow \ndata augmentation technique and do data augmentation by using keras libraries and \nexplore all its face recognition related tools."
        },
        {
            "goal": "- In Week 10, participants showcased their preliminary work on creating databases for the student attendance project, engaging in an in-depth exploration of the CV2 libraries to enhance data collection methods, specifically through the utilization of the CV2 frontal face classifier. This effort significantly expanded the dataset, which was deemed a constructive approach by mentor Mr. Ivan. Attention then shifted towards data augmentation using Keras, with a focus on applications like VGG16 to refine data classification. Despite achieving promising accuracy, challenges related to model overfitting were identified and addressed, with the mentor advising further exploration of Keras functionalities such as imageDataGenerator. The project's next phase involves advancing to face recognition, keeping the overall development well-aligned with the set timelines. The participant is also independently investigating applications like facenet and delving into scholarly research to bolster the project's face recognition capabilities.\n",
            "id": "7.10",
            "name": "WEEK#",
            "nodeType": "Paragraph",
            "page": null,
            "text": "WEEK#10 \nThe 10th week is making progress on the project.  \nThis week, we have presented our initial work to our mentor which is created databases, \nthis week while working on project I have explored CV2 libraries which use to classifier as \ndata collected before that was not very much productive so I am improving my data \ncollection process for which I have explored CV2 frontal face classifier and capture 100 more \npictures so we can have more data to work with, As presented to Mr. Ivan we have \ndiscussed that this is an good approach for collection of data. The next step is augmentation \nof keras, I have explored few keras applications like VGG16 for classification of data by using \nVGG16 I have so far successful to train my model which is giving me quite good accuracy but \nit needs to be mitigated as I believe my model is overfitting on my current data while \ndiscussing these points to our mentor, we have tried few things and he suggested to try \nsome other application of kera which are imageDataGenerator and, etc.  \nWe have assigned to go on the next step which is recognition as far we are quite on track \nand on timeline with the project meanwhile, I am trying to work on how to use facenet and \nother application available for that I am going through some research and making good use \nof papers available regarding face recognition."
        },
        {
            "goal": "- Week 11 of the program is mentioned without further details provided.\n",
            "id": "7.11",
            "name": "17 \nW",
            "nodeType": "Paragraph",
            "page": null,
            "text": "17 \nWEEK#11"
        },
        {
            "goal": "- During Week 11, the project's focus was on addressing and resolving discrepancies, particularly related to face recognition tasks. Initial discussions revolved around the challenges encountered in model training and accuracy. After presenting recent updates and successes, the need for a revised approach was identified, leading to the mentor's recommendation of exploring new libraries suited for enhancing accuracy within the given environment. Further discussions extended to the broader context of the data science industry, preparing participants for future professional pursuits and resolving specific technical issues with CV2 libraries. The session concluded with assignments centered on utilizing a face recognition library with C++ features, aimed at improving project outcomes, especially the automated marking of attendance through webcam recognition, which will be recorded in a CSV file. The narrative provides an insightful glimpse into the iterative process of troubleshooting and skill development within the project's framework.\n",
            "id": "7.12",
            "name": "The 1",
            "nodeType": "Paragraph",
            "page": null,
            "text": "The 11\nth week is resolving discrepancies in the project.  \nThis week, we have discussed about the challenges we are getting while working on the \nproject, in the first session of this week we have presented the updates on your projects \nwhich was the one step up in the work of face recognition. I have successfully trained few \nmodels over my data but also while discussing the issues facing, I have found out that I need \nto try to use different approach and our mentor has shown us few different libraries which \nare available and would be much easier to resolve the accuracy issues I am facing while \nworking on the environment. In the second session we have discussed the market of data \nscience industry and quite few insights of what and how we all can get ready ourselves for \nthe coming chapter of our lives and also while discussing on project we have resolved some \nimportant issues related to CV2 libraries, also to go forward we have been assigned a task to \ntry use face recognition library which has C++ features and how we can integrate it with our \nproject to get better results and mark attendance in csv file.  \nSo far, we have done augmentation which is the labelling of the data, then we have done \nthe classification which is comparing and telling us which class the data belongs too now we \nare working on the marking the attendance by comparing the face from webcam and mark \nthe personnel attendance in the csv file.  \nWEEK#12"
        },
        {
            "goal": "- Week 12 of the project was dedicated to discussing new findings related to the project and the work environment. This period served as an opportunity for team members to share discoveries, advancements, and experiences that have emerged from their ongoing work, as well as to evaluate the current workflow and collaboration within the project setting.\n",
            "id": "7.13",
            "name": "The 1",
            "nodeType": "Paragraph",
            "page": null,
            "text": "The 12th week is discussing the new findings and work environment."
        },
        {
            "goal": "- In the initial session of Week 12, participants addressed challenges encountered with the integration of the pre-built Python face recognition library into their project environment, including specific errors that were obstructing progress. Through discussion with the mentor, a more effective solution to these issues was identified. This session also allowed participants to reflect on their learning journey, discussing the knowledge and skills acquired throughout the project and how these have contributed to overcoming project hurdles. To conclude this phase of the internship, participants were tasked with preparing a presentation to showcase their project achievements, serving as the final presentation of their internship experience, highlighting both the technical accomplishments and the learning outcomes.\n",
            "id": "7.14",
            "name": "In th",
            "nodeType": "Paragraph",
            "page": null,
            "text": "In the first session we have discussed the issues we are facing in the project by using face \nrecognition library of python which is already been build and to incorporate it with our \nenvironment I was getting few errors which I have discussed with the mentor and we found \na better solution regarding that issue, in this meeting everyone has discussed what they \nhave learned so far and how it’s helping them to get done this project and for the next \nsession we have been asked to have a presentation to show what we have done so far on \nthe project and present it as our final presentation of this internship."
        },
        {
            "goal": "- In the concluding session of the internship, participants were required to present their projects in a formal presentation format. The person successfully delivered a PowerPoint presentation, effectively meeting the project's objectives. This session marked the end of the internship period, during which feedback was exchanged regarding the overall program. Additionally, the mentor, Mr. Ivan, offered valuable advice on enhancing resumes, preparing for job interviews, and utilizing resources for job applications, providing guidance for the interns' forthcoming professional endeavors.\n",
            "id": "7.15",
            "name": "In th",
            "nodeType": "Paragraph",
            "page": null,
            "text": "In the second session we have been asked to present our project in form of presentation, I \nhave presented my project in PPT and so far, get succussed to achieve the objective of the \nproject.  \nThis was our last session as an internee and we exchange feedback of the program overall \nand Mr. Ivan gave us few tips on how we can make our resume better and how to get \nprepared for the interviews and what resources we can use for job application."
        }
    ],
    "goal": "REFLECTIVE JOURNAL ENTRIES\n- The reflective journal documents the participant's experiences from the first to sixth weeks of the program, employing the DIEP approach to provide a comprehensive analysis of activities, tasks, and learning objectives. This method encourages detailed recording and reflection on experiences ('D' for Describe), interpreting the significance of these experiences ('I' for Interpret), evaluating the effectiveness of actions taken ('E' for Evaluate), and planning future applications of learned knowledge ('P' for Plan). Insights into new understandings, teamwork dynamics, and personal growth are discussed, alongside reflections guided by mentor Ivan Bakhshayeshi and coordinator Jennifer Yang, making the journal a tool for tracking performance and deriving lessons for career advancement.\n\nWEEK#07\n- In the 7th week of the program, the project officially commenced with a consultation hour focusing on its objectives, significance in deep learning applications, and real-world impact. The mentor, Mr. Ivan, shared insights from his own professional experience with similar projects, emphasizing the complexities of working with big data. Discussions included the project's vast scope, integration possibilities, and the need to navigate challenges related to face recognition technologies. The mentor outlined the project's protocols, suggesting a shift to bi-weekly sessions post-Easter break for task assignments and presentations. Participants, reflecting on their academic and project-related experiences in data science, were encouraged to research face recognition systems further, identifying potential depths and challenges. The mentor's enthusiasm significantly motivated the participants, fostering a collaborative environment to address the project's challenges. In the follow-up session, specific issues and the extent of project development were deliberated, with an emphasis on leveraging relevant libraries for face recognition.\n\n- The sessions post-Easter break were strategically rescheduled to ensure continued progress on the project. This adjustment was part of a broader conclusion that emphasized the effective learning environment provided by the ITIC team, where both the mentor and Ms. Jennifer actively addressed and entertained all participant queries, fostering a supportive and insightful educational experience.\n\n- The reflective journal details events up to week 7, noting the transition to one consultation and one presentation session per week as guided by the mentor, Mr. Ivan. This change aims to foster improved learning outcomes by assigning specific tasks for practice and presentation, encouraging a professional approach and mindset. Participants are expected to engage deeply with their assignments, preparing to address queries and share insights in a professional setting, which is anticipated to enrich the learning experience further as the program progresses.\n\nWEEK#08\n- Week 8 marked the initiation of the project focused on creating a student attendance system utilizing face recognition technology. The mentor, Mr. Ivan, detailed the project's goals and the technical framework necessary for its achievement, emphasizing the use of live cameras for identifying students in online classes to assist teachers with accurate attendance marking. Participants received a foundational understanding of the technology and its applications, with instructions to commence building a database using TensorFlow's data augmentation techniques and Keras for at least 20 images. This hands-on approach aimed at fostering a deeper exploration of the subject matter provided an opportunity for participants to clarify their theoretical knowledge under the guidance of a professional mentor, enriching their learning experience.\n\n- In Week 9, the focus shifted to the practical aspects of project development, with the mentor guiding the participants on constructing a database integral for the student attendance system. The use of CV2, a Python library, was recommended for capturing live images to build a substantial dataset of student faces. The collaborative effort was emphasized, suggesting the sharing of databases among participants to refine the model's accuracy through broader data testing. The session concluded with task assignments that involve enhancing the database with TensorFlow and Keras's data augmentation techniques and further exploring tools related to face recognition, aiming to solidify the foundational work for the project's success.\n\n- In Week 10, participants showcased their preliminary work on creating databases for the student attendance project, engaging in an in-depth exploration of the CV2 libraries to enhance data collection methods, specifically through the utilization of the CV2 frontal face classifier. This effort significantly expanded the dataset, which was deemed a constructive approach by mentor Mr. Ivan. Attention then shifted towards data augmentation using Keras, with a focus on applications like VGG16 to refine data classification. Despite achieving promising accuracy, challenges related to model overfitting were identified and addressed, with the mentor advising further exploration of Keras functionalities such as imageDataGenerator. The project's next phase involves advancing to face recognition, keeping the overall development well-aligned with the set timelines. The participant is also independently investigating applications like facenet and delving into scholarly research to bolster the project's face recognition capabilities.\n\n- Week 11 of the program is mentioned without further details provided.\n\n- During Week 11, the project's focus was on addressing and resolving discrepancies, particularly related to face recognition tasks. Initial discussions revolved around the challenges encountered in model training and accuracy. After presenting recent updates and successes, the need for a revised approach was identified, leading to the mentor's recommendation of exploring new libraries suited for enhancing accuracy within the given environment. Further discussions extended to the broader context of the data science industry, preparing participants for future professional pursuits and resolving specific technical issues with CV2 libraries. The session concluded with assignments centered on utilizing a face recognition library with C++ features, aimed at improving project outcomes, especially the automated marking of attendance through webcam recognition, which will be recorded in a CSV file. The narrative provides an insightful glimpse into the iterative process of troubleshooting and skill development within the project's framework.\n\n- Week 12 of the project was dedicated to discussing new findings related to the project and the work environment. This period served as an opportunity for team members to share discoveries, advancements, and experiences that have emerged from their ongoing work, as well as to evaluate the current workflow and collaboration within the project setting.\n\n- In the initial session of Week 12, participants addressed challenges encountered with the integration of the pre-built Python face recognition library into their project environment, including specific errors that were obstructing progress. Through discussion with the mentor, a more effective solution to these issues was identified. This session also allowed participants to reflect on their learning journey, discussing the knowledge and skills acquired throughout the project and how these have contributed to overcoming project hurdles. To conclude this phase of the internship, participants were tasked with preparing a presentation to showcase their project achievements, serving as the final presentation of their internship experience, highlighting both the technical accomplishments and the learning outcomes.\n\n- In the concluding session of the internship, participants were required to present their projects in a formal presentation format. The person successfully delivered a PowerPoint presentation, effectively meeting the project's objectives. This session marked the end of the internship period, during which feedback was exchanged regarding the overall program. Additionally, the mentor, Mr. Ivan, offered valuable advice on enhancing resumes, preparing for job interviews, and utilizing resources for job applications, providing guidance for the interns' forthcoming professional endeavors.\n\n",
    "id": 7,
    "name": "REFLECTIVE JOURNAL ENTRIES",
    "nodeType": "Section",
    "page": 14,
    "text": "REFLECTIVE JOURNAL ENTRIES \n \nThe reflective journal has the information of all the weeks till now which are one to sixth \nweek so far, it includes all the detailed discussion of the activities which are carried forward \nin this program and the detailed description of the task has been assigned and learning \nobjectives which has been delivered so far from the organization and mentor. This journal \nhelps me to keep track of my performance in all over the period of this program. The \napproach used to write this journal is pretty informative that is called DIEP approach as \ngiven in the template, where the word ‘D’ stands for describe which hold the objective of \nwhat happened? What did I see? What did I read? What did I have heard? And so on while \nthe word ‘I’ stands for interpretation of the events which occurred during this program and \nhave detailed about new insights, my connection with other attendees presented in  this \nprogram, my feelings towards them, the team work if there’s any involved, my hypothesis \nfollowed by conclusion and then we have the word ‘E’ which sums up the efficiency of what \nI have observed, my opinion regarding those observations, effectiveness of observation and \non what grounds I am making these experiences count, last but not the least we have the \nword ‘P’ which stands for planning of how this learning experience is useful in future for my \ncareer and what its serves in the long professional run and what are my recommendations.  \nAll the fellow activates and task happened under the supervision of the mentor Ivan \nBakhshayeshi and the coordinator of this program who is Jennifer Yang.  \n \n \nWEEK#07 \n \nIn the 7th week we have kick start of the project, in 1st session of the week was all about \nconsultation hour where we discussed the overview of the project and my mentor Mr. Ivan \nhas demonstrated the project’s aim and purpose and importance of this deep learning \nproject in the real world.  \nWhile discussing the project outcomes, we come across that this is the very vast project and \nhas previously been worked on but still it does have so many features which can be \nintegrated with it, this session we discussed that our mentor has also worked in this kind of \nproject in his professional life and how hard it is to work with big data in cooperation with \nthis kind of application.  \nOur mentor has also discussed what are the protocols to work on this project where we \ncome across that from now on after easter break we will have two session per week same \nas past but in the first session we will assign the task related to the project and in the \nsecond session we all have present our work to the mentor.  \nIn this meeting we have also discussed the related problems regarding this project and \neveryone has a say who related to the data science background what we have achieve in \nour university times and what deep learning projects we have worked with on academic \nlevel and in the end, we have been assigned to study related or similar problems of face \nrecognition systems and how deep we can go and what challenges we can face while \nworking on this application. The enthusiasm and support from the mentor were pretty high \nwhich gives me motivation to do better.  \nIn the 2nd session we discussed the related problems and challenges which needs to \novercome while working on this project. The libraries we have explored related to face \nrecognition system been discussed to and to what extend we should take this project been \n \n15 \nhighlighted too. In the end, we got our rescheduled for the upcoming sessions and how we \nwill proceed with these in future after easter break.  \nIn conclusion, so we have great learning environment provided by ITIC team and all our \nqueries has been entertained from both our mentor and Ms. Jennifer. \n \n \nThis reflective journal holds the detailed events’ entries till week#7 as we will go forward \nthere’s going to be new findings, observations and learning experiences will come by time. \nThe project has been kicked in from the last week and as by mentor there’s going be one \nsession per week which will be reserved for consultation and the other one would use for \npresentation of the work we will perform and keeping in loop with Mr. Ivan would help me \nto get better learning outcomes out of this program, so far this is what I have observed, He \nalso mentioned that in consulting session we all will be provided with different task which \nwe need to practice and present in the second session and these meetings would be really \nprofessional where you have to come up with different ideas and professional mindset \nalong with the research work home work so you can answer all the related queries of the \nattendees.  \n \nWEEK#08 \n \nThe 8th week is started with project initialization.  \nThis week, we have discussed about the objective of the project, where our mentor \nexplained what we are going to working on, which is going to be a student attendance \nsystem by using face recognition method. This project will be able to detect the faces of the \nstudent through live camera which helps the teachers to mark student attendance in online \nclasses. To start working on this project first we need background knowledge of the \nobjective and the available packages, so Mr. Ivan has shared quite good knowledge and \nmaterial of how these application works and their specifications.  \nWe have been assigned the task to start creating database by using TensorFlow data \naugmentation technique and explore all the related like image data generator and create \nand data base to start working, we all have to create a database of at least 20 images by \nusing keras data augmentation techniques and shared it around so we can go further from \nthere.  \nTo learn and explore about this project is an interesting part and working with the \nprofessional mentor helping me to clear my theories which I was shy enough to ask in my \nclass.  \n \n \n \n \n16 \nWEEK#09 \nThe 9th week is started working on the project.  \nThis week, we have discussed about the how to create the database for the project, our \nMentor has shown us how it needs to be done share some resources for the reference as \nwell, we have started making database that consists of images of the student, we are all \nadvised to share our databases with each other so we can test our model and get better and \naccurate results.  \nThe database should be created by using python library CV2 which will access your live \ncamera take snapshot which should be uploaded on some medium to be shared across the \nmates, so far, we are successful to create our individual datasets now we need to use keras \ndata augmentation techniques to train our data and get the results. In the first meeting we \nhave presented our datasets and discussed the issues facing while creating them.  \nWe have been assigned the task to start working with the database by using TensorFlow \ndata augmentation technique and do data augmentation by using keras libraries and \nexplore all its face recognition related tools.  \n \nWEEK#10 \nThe 10th week is making progress on the project.  \nThis week, we have presented our initial work to our mentor which is created databases, \nthis week while working on project I have explored CV2 libraries which use to classifier as \ndata collected before that was not very much productive so I am improving my data \ncollection process for which I have explored CV2 frontal face classifier and capture 100 more \npictures so we can have more data to work with, As presented to Mr. Ivan we have \ndiscussed that this is an good approach for collection of data. The next step is augmentation \nof keras, I have explored few keras applications like VGG16 for classification of data by using \nVGG16 I have so far successful to train my model which is giving me quite good accuracy but \nit needs to be mitigated as I believe my model is overfitting on my current data while \ndiscussing these points to our mentor, we have tried few things and he suggested to try \nsome other application of kera which are imageDataGenerator and, etc.  \nWe have assigned to go on the next step which is recognition as far we are quite on track \nand on timeline with the project meanwhile, I am trying to work on how to use facenet and \nother application available for that I am going through some research and making good use \nof papers available regarding face recognition.  \n \n \n \n \n17 \nWEEK#11 \n \nThe 11\nth week is resolving discrepancies in the project.  \nThis week, we have discussed about the challenges we are getting while working on the \nproject, in the first session of this week we have presented the updates on your projects \nwhich was the one step up in the work of face recognition. I have successfully trained few \nmodels over my data but also while discussing the issues facing, I have found out that I need \nto try to use different approach and our mentor has shown us few different libraries which \nare available and would be much easier to resolve the accuracy issues I am facing while \nworking on the environment. In the second session we have discussed the market of data \nscience industry and quite few insights of what and how we all can get ready ourselves for \nthe coming chapter of our lives and also while discussing on project we have resolved some \nimportant issues related to CV2 libraries, also to go forward we have been assigned a task to \ntry use face recognition library which has C++ features and how we can integrate it with our \nproject to get better results and mark attendance in csv file.  \nSo far, we have done augmentation which is the labelling of the data, then we have done \nthe classification which is comparing and telling us which class the data belongs too now we \nare working on the marking the attendance by comparing the face from webcam and mark \nthe personnel attendance in the csv file.  \nWEEK#12 \n \nThe 12th week is discussing the new findings and work environment.  \n \nIn the first session we have discussed the issues we are facing in the project by using face \nrecognition library of python which is already been build and to incorporate it with our \nenvironment I was getting few errors which I have discussed with the mentor and we found \na better solution regarding that issue, in this meeting everyone has discussed what they \nhave learned so far and how it’s helping them to get done this project and for the next \nsession we have been asked to have a presentation to show what we have done so far on \nthe project and present it as our final presentation of this internship.  \n \nIn the second session we have been asked to present our project in form of presentation, I \nhave presented my project in PPT and so far, get succussed to achieve the objective of the \nproject.  \nThis was our last session as an internee and we exchange feedback of the program overall \nand Mr. Ivan gave us few tips on how we can make our resume better and how to get \nprepared for the interviews and what resources we can use for job application."
}